app/Http/Controllers/PCC/RequestController.php

select * from `v_official_business_list` where `STATUS` = 'Approved'
select * from `v_business_nature`
select * from `v_resident`
select * from `v_pending_application_form`
select * from `v_approved_application_form`
select * from `v_declined_application_form`
---
   public function index($typeofview){
    	$approved_business = DB::table('v_official_business_list')->where('STATUS','Approved')->get();
    	$business_nature = DB::table('v_business_nature')->get();
        $resident = DB::table('v_resident')->get();

   		$pending_application_form = DB::table('v_pending_application_form')->get();
        $approved_application_form = DB::table('v_approved_application_form')->get();
        $declined_application_form = DB::table('v_declined_application_form')->get();

select `PAPER_TYPE_ID` from `r_paper_type` where `PAPER_TYPE_NAME` = 'Barangay Clearance Building' limit 1
select `PAPER_TYPE_ID` from `r_paper_type` where `PAPER_TYPE_NAME` = 'Application Barangay Clearance Form' limit 1
---
            $BUSINESS_ID = $request->BUSINESS_ID;
            $APPLICANT_NAME = $request->APPLICANT_NAME;

        $clearance_type_id = DB::table('r_paper_type')
            ->where('PAPER_TYPE_NAME', $PAPER_TYPE_CLEARANCE)
            ->select('PAPER_TYPE_ID')
            ->first();
        $form_type_id = DB::table('r_paper_type')
            ->where('PAPER_TYPE_NAME', $PAPER_TYPE_FORM)
            ->select('PAPER_TYPE_ID')
            ->first();

insert into `t_application_form` (`FORM_NUMBER`, `PAPER_TYPE_ID`, `STATUS`, `BUSINESS_ID`, `RECEIVED_BY`, `REQUESTED_PAPER_TYPE_ID`, `APPLICANT_NAME`) values ('XXXX-XXX', '2', 'Pending', '100', 'Shiela Mae A. Velga', '15', '')
select `FORM_ID` from `t_application_form` order by `FORM_ID` desc limit 1
---
            return response()->json(['message' => $latest_form_id] );
        }
        else if ($PAPER_TYPE_CLEARANCE == "Barangay Clearance Building"){
         $application_form = DB::Table('t_application_form')
            ->insert(array(
                'FORM_NUMBER' => 'XXXX-XXX'
                ,'PAPER_TYPE_ID' => $form_type_id->PAPER_TYPE_ID
                ,'STATUS' => 'Pending'
                ,'BUSINESS_ID' => $BUSINESS_ID
                ,'RECEIVED_BY' => 'Shiela Mae A. Velga'
                ,'REQUESTED_PAPER_TYPE_ID' => $clearance_type_id->PAPER_TYPE_ID
                ,'APPLICANT_NAME' => $APPLICANT_NAME

            ));

            $latest_form_id = DB::table('t_application_form')->select('FORM_ID')->latest('FORM_ID')->first();

select `PAPER_TYPE_ID` from `r_paper_type` where `PAPER_TYPE_NAME` = 'Barangay Certificate Residency' limit 1
select `PAPER_TYPE_ID` from `r_paper_type` where `PAPER_TYPE_NAME` = 'Request Barangay Certification Form' limit 1
insert into `t_application_form` (`FORM_NUMBER`, `PAPER_TYPE_ID`, `STATUS`, `RESIDENT_ID`, `RECEIVED_BY`, `REQUESTED_PAPER_TYPE_ID`, `APPLICANT_NAME`) values ('XXXX-XXX', '3', 'Pending', '3865', 'Shiela Mae A. Velga', '22', 'ozcan')
select `FORM_ID` from `t_application_form` order by `FORM_ID` desc limit 1
insert into `t_bf_barangay_certification` (`PURPOSE`, `FORM_ID`) values ('sample', '62')
---
        // INDIGENCY - F
        $F_PURPOSE = $request->F_PURPOSE;

        $certificate_type_id = DB::table('r_paper_type')
            ->where('PAPER_TYPE_NAME', $CERTIFICATE_TYPE)
            ->select('PAPER_TYPE_ID')
            ->first();
        $form_type_id = DB::table('r_paper_type')
            ->where('PAPER_TYPE_NAME', $FORM_TYPE)
            ->select('PAPER_TYPE_ID')
            ->first();

        if($CERTIFICATE_TYPE == "Barangay Certificate Residency"){
            $application_form = DB::Table('t_application_form')
                ->insert(array(
                    'FORM_NUMBER' => 'XXXX-XXX'
                    ,'PAPER_TYPE_ID' => $form_type_id->PAPER_TYPE_ID
                    ,'STATUS' => 'Pending'
                    ,'RESIDENT_ID' => $RESIDENT_ID
                    ,'RECEIVED_BY' => 'Shiela Mae A. Velga'
                    ,'REQUESTED_PAPER_TYPE_ID' => $certificate_type_id->PAPER_TYPE_ID
                    ,'APPLICANT_NAME' => $APPLICANT_NAME
                ));

            $latest_form_id = DB::table('t_application_form')->select('FORM_ID')->latest('FORM_ID')->first();

            $barangay_certificate = DB::table('t_bf_barangay_certification')
                ->insert(array(
                    'PURPOSE' => $A_PURPOSE
                    ,'FORM_ID' => $latest_form_id->FORM_ID
                ));

select `PAPER_TYPE_ID` from `r_paper_type` where `PAPER_TYPE_NAME` is null limit 1
---
            $APPLICANT_NAME = $request->APPLICANT_NAME;


        $clearance_type_id = DB::table('r_paper_type')
            ->where('PAPER_TYPE_NAME', $PAPER_TYPE_CLEARANCE)
            ->select('PAPER_TYPE_ID')
            ->first();
        $form_type_id = DB::table('r_paper_type')
            ->where('PAPER_TYPE_NAME', $PAPER_TYPE_FORM)
            ->select('PAPER_TYPE_ID')
            ->first();