app/Http/Controllers/ListofOrdinanceController.php

    public function index()
    {
    	$ordinances = $this->getordinances();
    	 $category = \DB::TABLE('r_ordinance_category')
                    ->PLUCK('ORDINANCE_CATEGORY_NAME','ORDINANCE_CATEGORY_ID');
---
select `ORDINANCE_CATEGORY_NAME`, `ORDINANCE_CATEGORY_ID` from `r_ordinance_category`