app/Http/Controllers/OrdinanceController.php

select `ORDINANCE_CATEGORY_NAME`, `ORDINANCE_CATEGORY_ID` from `r_ordinance_category`
---
    public function index()
    {
        $barangay_id = session('session_brgy_id');

        $ordinances = COLLECT(\DB::SELECT("SELECT O.ORDINANCE_ID,
                                            O.ORDINANCE_AUTHOR, O.ORDINANCE_TITLE, O.ORDINANCE_SANCTION, O.ORDINANCE_REMARKS,    O.ORDINANCE_DESCRIPTION, O.ACTIVE_FLAG
                                            FROM t_ordinance AS O
                                            "));

        $category = \DB::TABLE('r_ordinance_category')
                    ->PLUCK('ORDINANCE_CATEGORY_NAME','ORDINANCE_CATEGORY_ID');

update `t_ordinance` set `ORDINANCE_TITLE` = 'first ordinance', `ORDINANCE_DESCRIPTION` = 'exile to Jeju Islands', `ORDINANCE_AUTHOR` = 'sarah joy lambino', `ORDINANCE_SANCTION` = 'undefined', `ORDINANCE_REMARKS` = 'sample ordinance' where `ORDINANCE_ID` = '23'
---
    public function update()
    {

        $ordinance_file = request()->file('file[]');
        $ordinance_id = request('ordinance_id');
            \DB::TABLE('t_ordinance')
            ->where('ORDINANCE_ID',$ordinance_id)
            ->update(
                [
                    'ORDINANCE_TITLE'      => request('title'),
                    'ORDINANCE_DESCRIPTION'=> request('description'),
                    'ORDINANCE_AUTHOR'     => request('author'),
                    //edited by SJ 06172020 - changed request('santion') to request('sanction')
                    //related file - resources/views/ordinance/ordinance.blade.php
                    'ORDINANCE_SANCTION'   => request('sanction'),

                    'ORDINANCE_REMARKS'    => request('remarks'),


                ]
            );

select * from `t_ordinance_images` where `ORDINANCE_ID` = '23'
---
    public function get_images()
    {
       $ordinance_id =  request('ordinance_id');
       $collect_images = \DB::table('t_ordinance_images')
            ->where('ORDINANCE_ID', $ordinance_id)
            ->get();