app/Http/Controllers/PatawagController.php

        public function index(request $request)
    {
        $disppatawag = DB::table('t_patawag AS P')
                            ->join('t_blotter AS B', 'P.blotter_id', '=', 'B.blotter_id')
                            ->select('P.patawag_id'
                                , 'P.patawag_sched_datetime'
                                , 'P.patawag_sched_place'
                                , 'P.status'
                                , 'B.blotter_id'
                                , 'B.blotter_code')
                            ->where(['P.status' => 'Pending'])
                            ->orderBy('P.patawag_sched_datetime', 'desc')
                            ->get();
---
select `P`.`patawag_id`, `P`.`patawag_sched_datetime`, `P`.`patawag_sched_place`, `P`.`status`, `B`.`blotter_id`, `B`.`blotter_code` from `t_patawag` as `P` inner join `t_blotter` as `B` on `P`.`blotter_id` = `B`.`blotter_id` where (`P`.`status` = 'Pending') order by `P`.`patawag_sched_datetime` desc