app/Http/Controllers/ResidentsController.php

select `RT`.`TYPE_NAME`, `RT`.`TYPE_ID` from `r_resident_type` as `RT`
---
    public function index(Request $request)
    {

        $resident_type = DB::TABLE('r_resident_type AS RT')
                            ->PLUCK('RT.TYPE_NAME','RT.TYPE_ID');