app/Http/Controllers/UserAccountsController.php

    public function index()
    {
        //$this->sign_out();
        $position_name = session('session_position');
        $DisplayData = db::table('v_realbarangayofficialsaccount')->get();
---
select * from `v_realbarangayofficialsaccount`

                }
                else if(request('PermissionName')=='O')
                {
                    $BarangayOfficial = TUser::where('BARANGAY_OFFICIAL_ID',request('BarangayOfficialID'))->first();
---
select * from `t_users` where `BARANGAY_OFFICIAL_ID` = '47' limit 1

                }
                else if(request('PermissionName')=='O')
                {
                    $BarangayOfficial = TUser::where('BARANGAY_OFFICIAL_ID',request('BarangayOfficialID'))->first();
                    $BarangayOfficial->PERMIS_BUSINESSES=0;
                    $BarangayOfficial->save();
---
select * from `t_users` where `BARANGAY_OFFICIAL_ID` = '47' limit 1
update `t_users` set `PERMIS_BUSINESSES` = 0 where `USER_ID` = '66'

    public function signin(Request $request)
    {

        $username = $request->GET('UsernameTxt');
        $password = $request->GET('PasswordTxt');
        session(['session_position' => "sample"]);

        $checkuser = TUser::SELECTRAW("COUNT(*) AS TOTAL")->WHERE('USERNAME','=', $username)->FIRST();

        if(intval($checkuser->TOTAL) > 0)
        {

            $getpassword = TUser::SELECT("PASSWORD")->WHERE('USERNAME','=', $username)->FIRST();
            if(password_verify($password, $getpassword->PASSWORD))
            {

                $checkrole = \DB::TABLE('v_useraccounts')->WHERE('USERNAME', $username)->WHERE('ACTIVE_FLAG',1)->GET();
                foreach ($checkrole as $val)
                {
                    $count = db::table('r_position')->where('POSITION_NAME',$val->POSITION_NAME)->count();
                    if( $count > 0 && $val->POSITION_NAME != 'Admin')
                    {
                            $getpermission = \DB::TABLE('v_realbarangayofficialsaccount')->WHERE('USERNAME', $username)->GET();
---
select COUNT(*) AS TOTAL from `t_users` where `USERNAME` = 'ALYSSA.VALDEZ' limit 1
select `PASSWORD` from `t_users` where `USERNAME` = 'ALYSSA.VALDEZ' limit 1
select * from `v_useraccounts` where `USERNAME` = 'ALYSSA.VALDEZ' and `ACTIVE_FLAG` = 1
select count(*) as aggregate from `r_position` where `POSITION_NAME` = 'Secretary'
select * from `v_realbarangayofficialsaccount` where `USERNAME` = 'ALYSSA.VALDEZ'


                            }

                            $getbrgychair = \DB::TABLE('v_realbarangayofficialsaccount')
                            ->WHERE(strtolower('POSITION_NAME'), strtolower("barangay chairman"))->GET();
---
select * from `v_realbarangayofficialsaccount` where `position_name` = 'barangay chairman'

                        else
                        if ($val->POSITION_NAME == 'Data Protection Officer' || $val->POSITION_NAME == 'Admin')
                        {
                            $getaccount = \DB::TABLE('v_adminaccount')->WHERE('USERNAME', $username)->GET();
---
select * from `v_adminaccount` where `USERNAME` = 'sarahjoy'

    public function update_my_account()
    {
        $random_password = str_random(8);
        $username = session('session_username');
        $editaccount = new TUser();
        session()->forget('session_email');
        $editaccount = TUser::where('USER_ID',request('UserID'))->first();
        $editaccount->EMAIL = request('EmailTxt');
        session(['session_email' => request('EmailTxt')]);
        $editaccount->save();
---
select * from `t_users` where `USER_ID` = '67' limit 1
update `t_users` set `EMAIL` = 'user3@mail.com1' where `USER_ID` = '67'